Repository: neokapi/neokapi
Catalog: l10n/tm/cli-nb.tmx
Source language: en
Languages: nb

source: A localization and translation toolkit
nb: Et verktøysett for lokalisering og oversettelse

source: Add a registry to global config
nb: Legg til et register i global konfigurasjon

source: Add file patterns to the project's content
nb: Legg til filmønstre i prosjektets innhold

source: Add file patterns to this project's content so kapi knows which files to process. Patterns support ** for recursive matching. Format is auto-detected from the extension unless --format is given. kapi add "src/**/*.html" kapi add "locales/*.json" --format json kapi add "src/**/*.html" "content/**/*.md"
nb: Legg til filmønstre i prosjektets innhold slik at kapi vet hvilke filer som skal behandles. Mønstre støtter ** for rekursiv matching. Formatet gjenkjennes automatisk fra filendelsen med mindre --format er angitt. kapi add "src/**/*.html" kapi add "locales/*.json" --format json kapi add "src/**/*.html" "content/**/*.md"

source: An import session is created every time a TMX file is imported. Each session records the file's SHA-256 hash, TMX header metadata, and the number of entries imported. Origins on TM entries point back to the session that added them so you can filter the TM by import source.
nb: En importøkt opprettes hver gang en TMX-fil importeres. Hver økt registrerer filens SHA-256-hasj, TMX-headerens metadata og antall importerte enheter. Opphav på TM-enheter peker tilbake til økten som la dem til, slik at du kan filtrere oversettelsesminnet på importkilde.

source: Analysis
nb: Analyse

source: Apply a returned bilingual file (.klz/XLIFF/PO) back onto the project source
nb: Flett en returnert tospråklig fil (.klz/XLIFF/PO) tilbake inn i prosjektkilden

source: Available flows:
nb: Tilgjengelige flyter:

source: Available formats:
nb: Tilgjengelige formater:

source: Available tools:
nb: Tilgjengelige verktøy:

source: CHANNELS
nb: KANALER

source: Check, rewrite, and govern content against a brand voice profile. Profile source (mutually exclusive): --profile <name> Profile in the local brand store (see 'kapi brand profiles') --profile-file <path> Standalone profile YAML (git-shareable, no store needed) --pack <name> Built-in starter pack (professional-b2b, friendly-dtc, technical-docs, marketing-blog, customer-support) Text input for check/rewrite is read from --text, or from stdin when --text is omitted or set to "-".
nb: Kontroller, omskriv og styr innhold mot en merkevarestemmeprofil. Profilkilde (gjensidig utelukkende): --profile <name> Profil i det lokale merkevarelageret (se 'kapi brand profiles') --profile-file <path> Frittstående profil-YAML (git-delbar, krever ikke lager) --pack <name> Innebygd startpakke (professional-b2b, friendly-dtc, technical-docs, marketing-blog, customer-support) Tekst til check/rewrite leses fra --text, eller fra stdin når --text er utelatt eller satt til "-".

source: Claude Code PreToolUse hook for Edit/Write/MultiEdit. Reads the PreToolUse-event JSON on stdin, resolves the .kapi project in the session's working directory, and: - emits {"hookSpecificOutput":{"permissionDecision":"deny",…}} (exit 0) when the file being written is a project content target (a path that "kapi merge" generates), so Claude routes the change through extract → translate → merge instead; or - emits nothing (exit 0) otherwise — outside a project, on source files, on files the project does not generate, or when the project cannot be loaded — leaving the normal permission flow untouched. Wire it up via the kapi Claude Code plugin (hooks/hooks.json) with a matcher of Edit|Write|MultiEdit. It fails open: anything other than a confirmed target match lets the edit proceed, so the guard never traps the assistant on an unrelated file.
nb: Claude Code PreToolUse-hook for Edit/Write/MultiEdit. Leser PreToolUse-hendelsens JSON på stdin, finner .kapi-prosjektet i øktens arbeidskatalog, og: - skriver {"hookSpecificOutput":{"permissionDecision":"deny",…}} (avslutningskode 0) når filen som skrives er et innholdsmål i prosjektet (en sti som "kapi merge" genererer), slik at Claude ruter endringen gjennom trekk ut → oversett → flett i stedet; eller - skriver ingenting (avslutningskode 0) ellers — utenfor et prosjekt, på kildefiler, på filer prosjektet ikke genererer, eller når prosjektet ikke kan lastes — og lar den vanlige tillatelsesflyten stå urørt. Koble den opp via kapi-tillegget for Claude Code (hooks/hooks.json) med matcher Edit|Write|MultiEdit. Den feiler åpent: alt annet enn et bekreftet måltreff lar redigeringen fortsette, så vakten fanger aldri assistenten på en urelatert fil.

source: Claude Code PreToolUse hook: block direct edits to kapi-generated translation targets
nb: Claude Code PreToolUse-hook: blokker direkte redigering av oversettelsesmål generert av kapi

source: Claude Code Stop hook. Reads the Stop-event JSON on stdin, runs the verify gates for the project in the session's working directory, and: - emits nothing (exit 0) when the project passes, when there is no .kapi project, or when verify cannot run — Claude is free to finish; or - emits {"decision":"block","reason":"…findings…"} (exit 0) when a gate fails, so Claude keeps working and fixes the findings before stopping. Wire it up via the kapi Claude Code plugin (hooks/hooks.json). It fails open: anything other than a clean gate failure lets Claude stop, so a missing project or a verify error never traps the assistant. Claude Code caps consecutive blocks, so an unfixable finding cannot loop forever.
nb: Claude Code Stop-hook. Leser Stop-hendelsens JSON på stdin, kjører verify-portene for prosjektet i øktens arbeidskatalog, og: - skriver ingenting (avslutningskode 0) når prosjektet består, når det ikke finnes noe .kapi-prosjekt, eller når verify ikke kan kjøre — Claude kan avslutte fritt; eller - skriver {"decision":"block","reason":"…funn…"} (avslutningskode 0) når en port feiler, slik at Claude fortsetter arbeidet og retter funnene før den stopper. Koble den opp via kapi-tillegget for Claude Code (hooks/hooks.json). Den feiler åpent: alt annet enn en ren portfeil lar Claude stoppe, så et manglende prosjekt eller en verify-feil fanger aldri assistenten. Claude Code begrenser antall påfølgende blokkeringer, så et funn som ikke kan rettes kan ikke gå i evig løkke.

source: Claude Code Stop hook: keep working until the project's kapi verify gates pass
nb: Claude Code Stop-hook: fortsett arbeidet til prosjektets kapi verify-porter består

source: Create a new kapi project with a {name}.kapi recipe and an adjacent .kapi/ state directory. By default the project id is the current directory's basename and source/target locales are en / (none). Override with --name, --source-locale, --target-locale (repeatable). --framework <name> pre-fills the content mapping for a known stack's i18n catalogs (see 'kapi presets list --framework'): react-i18next, react-intl, nextjs, vue-i18n, flutter, angular.
nb: Opprett et nytt kapi-prosjekt med en {name}.kapi-oppskrift og en tilhørende .kapi/-tilstandskatalog. Som standard er prosjekt-id-en navnet på gjeldende katalog, og kilde-/målspråk er en / (ingen). Overstyr med --name, --source-locale, --target-locale (kan gjentas). --framework <name> forhåndsutfyller innholdskartleggingen for i18n-katalogene til en kjent teknologistakk (se 'kapi presets list --framework'): react-i18next, react-intl, nextjs, vue-i18n, flutter, angular.

source: EXTENSIONS
nb: FILENDELSER

source: Emit a bilingual file for a translator — native .klz or XLIFF/PO
nb: Lag en tospråklig fil for en oversetter — nativ .klz eller XLIFF/PO

source: Emit bilingual XLIFF 2.x (default) or PO files for each target locale declared in a .kapi project, pre-filled from the project's translation memory. Each invocation writes one batch of outputs under .kapi/cache/extractions/<batch-id>/ plus one bilingual file per source → target pair in --out-dir (default "out/").
nb: Skriv tospråklige XLIFF 2.x-filer (standard) eller PO-filer for hvert målspråk som er deklarert i et .kapi-prosjekt, forhåndsutfylt fra prosjektets oversettelsesminne. Hver kjøring skriver én bunt med utdata under .kapi/cache/extractions/<batch-id>/ pluss én tospråklig fil per kilde → mål-par i --out-dir (standard "out/").

source: Export all skills to a directory (for the plugin bundle)
nb: Eksporter alle skills til en katalog (for tilleggspakken)

source: Export termbase to CSV, JSON, or TBX
nb: Eksporter termbase til CSV, JSON eller TBX

source: Export the TM to TMX 1.4 format. Each entry is written as a single <tu> with one <tuv> per language variant present (or the subset requested via --locales). Inline markup is preserved as TMX <ph>/<bpt>/<ept>/<it>/<hi>. By default all variants on every entry are emitted. Pass --locales to restrict to a subset (comma-separated).
nb: Eksporter oversettelsesminnet til TMX 1.4-format. Hver enhet skrives som én <tu> med én <tuv> per språkvariant som finnes (eller utvalget som er bedt om med --locales). Inline-merking bevares som TMX <ph>/<bpt>/<ept>/<it>/<hi>. Som standard skrives alle varianter på hver enhet. Bruk --locales for å begrense til et utvalg (kommaseparert).

source: Export translation memory to TMX
nb: Eksporter oversettelsesminne til TMX

source: FORMATS
nb: FORMATER

source: Force a rebuild of the plugin dispatch cache
nb: Bygg tilleggenes dispatch-hurtigbuffer på nytt

source: Generate a shell completion script for the specified shell. To load completions: Bash: $ source <(kapi completion bash) # Or install permanently: $ kapi completion bash > /etc/bash_completion.d/kapi Zsh: $ source <(kapi completion zsh) # Or install permanently: $ kapi completion zsh > "${fpath[1]}/_kapi" Fish: $ kapi completion fish | source # Or install permanently: $ kapi completion fish > ~/.config/fish/completions/kapi.fish PowerShell: PS> kapi completion powershell | Out-String | Invoke-Expression
nb: Generer et skript for skallfullføring for det angitte skallet. Slik laster du inn fullføringene: Bash: $ source <(kapi completion bash) # Eller installer permanent: $ kapi completion bash > /etc/bash_completion.d/kapi Zsh: $ source <(kapi completion zsh) # Eller installer permanent: $ kapi completion zsh > "${fpath[1]}/_kapi" Fish: $ kapi completion fish | source # Eller installer permanent: $ kapi completion fish > ~/.config/fish/completions/kapi.fish PowerShell: PS> kapi completion powershell | Out-String | Invoke-Expression

source: Generate shell completion script
nb: Generer skript for skallfullføring

source: Glue commands for AI coding assistants. Each subcommand reads the assistant's hook payload on stdin and writes the assistant's expected response on stdout. These are wired up by the assistant's plugin, not run by hand.
nb: Limkommandoer for AI-kodeassistenter. Hver underkommando leser assistentens hook-nyttelast på stdin og skriver svaret assistenten forventer på stdout. Disse kobles opp av assistentens tillegg og kjøres ikke for hånd.

source: Import a TMX file into translation memory
nb: Importer en TMX-fil til oversettelsesminnet

source: Import a profile YAML into the local brand store
nb: Importer en profil-YAML til det lokale merkevarelageret

source: Import a single TMX file (plain or .gz) into the TM. By default, imports entries matching the given --source-locale and --target-locale. Use --all-pairs to emit entries for every (src, tgt) language pair present in each TU — useful for multilingual TMX files (e.g. EUR-Lex Euramis exports where a single TU may contain 24+ languages). Combine with --locales to restrict the pair set (e.g. --all-pairs --locales en-GB,fr-FR,de-DE). The importer auto-detects UTF-8/UTF-16 from the BOM, so Euramis exports work without pre-conversion. For web-crawl TMX sets (bitextor output) the per-TUV <prop type="source-document"> URL is recorded as Origin.Reference.
nb: Importer én TMX-fil (ren eller .gz) til oversettelsesminnet. Som standard importeres enheter som samsvarer med angitt --source-locale og --target-locale. Bruk --all-pairs for å skrive enheter for hvert (kilde, mål)-språkpar som finnes i hver TU — nyttig for flerspråklige TMX-filer (f.eks. EUR-Lex Euramis-eksporter der én TU kan inneholde over 24 språk). Kombiner med --locales for å begrense parsettet (f.eks. --all-pairs --locales en-GB,fr-FR,de-DE). Importen gjenkjenner UTF-8/UTF-16 automatisk fra BOM-en, så Euramis-eksporter fungerer uten forhåndskonvertering. For TMX-sett fra webcrawl (bitextor-utdata) registreres URL-en i <prop type="source-document"> per TUV som Origin.Reference.

source: Import all TMX files from a directory into translation memory
nb: Importer alle TMX-filer fra en katalog til oversettelsesminnet

source: Import terms from CSV, JSON, or TBX into a termbase
nb: Importer termer fra CSV, JSON eller TBX til en termbase

source: Install Agent Skills that plug kapi into your AI coding assistant
nb: Installer Agent Skills som kobler kapi til AI-kodeassistenten din

source: Install a built-in starter pack into the local brand store
nb: Installer en innebygd startpakke i det lokale merkevarelageret

source: Install a plugin from a registry. The plugin is downloaded, verified (SHA-256 + cosign signature), and unpacked into $XDG_DATA_HOME/kapi/plugins/<name>/. Examples: kapi plugin install bowrain kapi plugin install bowrain@^1.0 kapi plugin install bowrain --channel beta
nb: Installer et tillegg fra et register. Tillegget lastes ned, verifiseres (SHA-256 + cosign-signatur) og pakkes ut i $XDG_DATA_HOME/kapi/plugins/<name>/. Eksempler: kapi plugin install bowrain kapi plugin install bowrain@^1.0 kapi plugin install bowrain --channel beta

source: Install a plugin from the registry
nb: Installer et tillegg fra registeret

source: Install and manage manifest-driven plugins (#438)
nb: Installer og administrer manifestdrevne tillegg (#438)

source: Install skills into .claude/skills (project or user scope)
nb: Installer skills i .claude/skills (prosjekt- eller brukernivå)

source: Install the bundled skills into a .claude/skills directory. --target project (default) → ./.claude/skills/<name>/SKILL.md --target user → ~/.claude/skills/<name>/SKILL.md Pass skill names to install a subset; omit to install all.
nb: Installer de medfølgende skills i en .claude/skills-katalog. --target project (standard) → ./.claude/skills/<name>/SKILL.md --target user → ~/.claude/skills/<name>/SKILL.md Oppgi skill-navn for å installere et utvalg; utelat for å installere alle.

source: Installed plugins:
nb: Installerte tillegg:

source: Integration hooks for AI coding assistants (Claude Code)
nb: Integrasjonshooks for AI-kodeassistenter (Claude Code)

source: Keep AI-generated content on brand (voice, tone, terminology)
nb: Hold AI-generert innhold i tråd med merkevaren (stemme, tone, terminologi)

source: List all file formats that can be read and written. Use --mime or --ext to filter by MIME type or file extension.
nb: List alle filformater som kan leses og skrives. Bruk --mime eller --ext for å filtrere på MIME-type eller filendelse.

source: List all import sessions
nb: List alle importøkter

source: List available flows
nb: List tilgjengelige flyter

source: List available presets
nb: List tilgjengelige forhåndsinnstillinger

source: List available processing tools
nb: List tilgjengelige behandlingsverktøy

source: List brand voice profiles (local store + built-in packs)
nb: List merkevarestemmeprofiler (lokalt lager + innebygde pakker)

source: List configured registries
nb: List konfigurerte registre

source: List installed plugins
nb: List installerte tillegg

source: List named TMs in KAPI_HOME
nb: List navngitte oversettelsesminner i KAPI_HOME

source: List named termbases in KAPI_HOME
nb: List navngitte termbaser i KAPI_HOME

source: List saved credentials
nb: List lagret legitimasjon

source: List supported file formats
nb: List filformater som støttes

source: List the bundled Agent Skills
nb: List de medfølgende Agent Skills

source: List the files matched by the project's content collections (honoring the exclude list). With --stats, also show per-file block and word counts. kapi ls kapi ls src/ kapi ls --stats
nb: List filene som matches av prosjektets innholdssamlinger (med respekt for ekskluderingslisten). Med --stats vises også antall blokker og ord per fil. kapi ls kapi ls src/ kapi ls --stats

source: List the files the project's content tracks
nb: List filene prosjektets innhold sporer

source: Look up a term in the termbase
nb: Slå opp en term i termbasen

source: Look up text in translation memory
nb: Slå opp tekst i oversettelsesminnet

source: MIME TYPES
nb: MIME-TYPER

source: Manage TMX import sessions
nb: Administrer TMX-importøkter

source: Manage format and framework presets
nb: Administrer format- og rammeverksforhåndsinnstillinger

source: Manage plugin registries
nb: Administrer tilleggsregistre

source: Manage project terminology. A termbase is a glossary of approved terms stored as a SQLite database. Use these commands to import, export, look up, and manage terms. Resource location (mutually exclusive): --name <n> Named termbase in KAPI_HOME (~/.config/kapi/termbases/<n>.db) --local Termbase in current directory (./termbase.db) --file <path> Explicit file path Default (no flag): same as --local (uses ./termbase.db).
nb: Administrer prosjektterminologi. En termbase er en ordliste med godkjente termer lagret som en SQLite-database. Bruk disse kommandoene til å importere, eksportere, slå opp og administrere termer. Ressursplassering (gjensidig utelukkende): --name <n> Navngitt termbase i KAPI_HOME (~/.config/kapi/termbases/<n>.db) --local Termbase i gjeldende katalog (./termbase.db) --file <path> Eksplisitt filsti Standard (uten flagg): samme som --local (bruker ./termbase.db).

source: Manage saved AI provider credentials
nb: Administrer lagret legitimasjon for AI-leverandører

source: Manage the bundled Agent Skills. These SKILL.md definitions teach an AI coding assistant (Claude Code, etc.) how to use kapi to keep generated content on-brand, terminologically consistent, and to publish multilingually. The kapi-* skills drive the local CLI; the bowrain-* skills drive the governed Bowrain platform.
nb: Administrer de medfølgende Agent Skills. Disse SKILL.md-definisjonene lærer en AI-kodeassistent (Claude Code o.l.) hvordan den bruker kapi til å holde generert innhold i tråd med merkevaren, terminologisk konsistent, og til å publisere flerspråklig. kapi-*-skills driver den lokale CLI-en; bowrain-*-skills driver den styrte Bowrain-plattformen.

source: Manage translation memory
nb: Administrer oversettelsesminne

source: Manage translation memory. A translation memory (TM) stores previously translated segments as a SQLite database. Use these commands to import/export TMX, look up matches, and manage TM entries. Resource location (mutually exclusive): --name <n> Named TM in KAPI_HOME (~/.config/kapi/tm/<n>.db) --local TM in current directory (./tm.db) --file <path> Explicit file path Default (no flag): same as --local (uses ./tm.db).
nb: Administrer oversettelsesminne. Et oversettelsesminne (TM) lagrer tidligere oversatte segmenter som en SQLite-database. Bruk disse kommandoene til å importere/eksportere TMX, slå opp treff og administrere TM-enheter. Ressursplassering (gjensidig utelukkende): --name <n> Navngitt TM i KAPI_HOME (~/.config/kapi/tm/<n>.db) --local TM i gjeldende katalog (./tm.db) --file <path> Eksplisitt filsti Standard (uten flagg): samme som --local (bruker ./tm.db).

source: Materialize localized files for a project, or apply bilingual files returned by a translator back onto the project's source locales. With no -i in a project, merge writes the localized files from the project block store: a process-only "kapi run" (in a project, no -o) commits its work as targets/<locale> overlays, and merge is the matching sink — it reads each source, applies the stored overlays, and writes the localized file via the source format's skeleton round-trip. With -i, merge applies one or more bilingual files returned by a translator back onto the project's source locales, using the skeleton captured by kapi extract. Each input carries the extraction batch id in a file-level <note>, so merge finds the right extraction manifest without guessing from the filename. Mixed target locales in one batch are fine — merge handles each input independently.
nb: Materialiser lokaliserte filer for et prosjekt, eller flett tospråklige filer fra en oversetter tilbake inn i prosjektets kildespråk. Uten -i i et prosjekt skriver merge de lokaliserte filene fra prosjektets blokklager: en ren prosesskjøring med "kapi run" (i et prosjekt, uten -o) lagrer arbeidet som targets/<locale>-overlegg, og merge er den tilhørende sluttfasen — den leser hver kilde, legger på de lagrede overleggene og skriver den lokaliserte filen via kildeformatets skjelett-rundtur. Med -i fletter merge én eller flere tospråklige filer fra en oversetter tilbake inn i prosjektets kildespråk, ved hjelp av skjelettet som ble fanget av kapi extract. Hver inndatafil bærer uttreksbunt-id-en i en <note> på filnivå, så merge finner riktig uttrekksmanifest uten å gjette fra filnavnet. Blandede målspråk i én bunt går fint — merge håndterer hver inndatafil uavhengig.

source: NAME
nb: NAVN

source: No flows defined.
nb: Ingen flyter er definert.

source: No registries configured.
nb: Ingen registre er konfigurert.

source: Other
nb: Annet

source: Output JSON Schema for a format
nb: Skriv ut JSON-skjema for et format

source: Print the JSON Schema for a tool's parameters
nb: Skriv ut JSON-skjemaet for et verktøys parametre

source: Print the brand voice guide (inject into your assistant's context)
nb: Skriv ut merkevarestemmeguiden (legg den inn i assistentens kontekst)

source: Print the translatable text of files (use kcat)
nb: Skriv ut den oversettbare teksten i filer (bruk kcat)

source: Quality
nb: Kvalitet

source: READ
nb: LES

source: Re-verify an installed plugin's manifest and binary
nb: Verifiser manifestet og binærfilen til et installert tillegg på nytt

source: Refresh the cached registry index
nb: Oppdater den hurtigbufrede registerindeksen

source: Rehydrate a project's working state from a .klz snapshot
nb: Gjenopprett et prosjekts arbeidstilstand fra et .klz-øyeblikksbilde

source: Remove a registry from global config
nb: Fjern et register fra global konfigurasjon

source: Remove a saved credential
nb: Fjern lagret legitimasjon

source: Remove a session record (entries are retained, session_id cleared)
nb: Fjern en øktoppføring (enhetene beholdes, session_id nullstilles)

source: Remove an installed plugin
nb: Fjern et installert tillegg

source: Remove file patterns from the project's content
nb: Fjern filmønstre fra prosjektets innhold

source: Remove installed skills from .claude/skills
nb: Fjern installerte skills fra .claude/skills

source: Rewrite text to comply with a brand voice profile
nb: Omskriv tekst slik at den følger en merkevarestemmeprofil

source: Run a composed flow (multi-tool pipeline)
nb: Kjør en sammensatt flyt (pipeline med flere verktøy)
